In [5]:
import numpy as np
import  pandas as pd
from matplotlib import pyplot as plt
df = pd.read_csv(r'C:\Users\U_M10Q3\Documents\titanicCoursera.csv')

In [78]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",1,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",1,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",1,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14.0,1,0,237736,30.0708,NaN,C

In [40]:
df.Sex = df.Sex.map({'male':1,'female': 0})

In [70]:
df.index(axis=0)

TypeError: 'RangeIndex' object is not callable

In [96]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null int64
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(6), object(4)
memory usage: 69.6+ KB

In [105]:
df1 = df.iloc[:, [2,4,5,9]].dropna()

In [106]:
df1.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [110]:
df1.Pclass.unique()

array([3, 1, 2], dtype=int64)

In [141]:
%matplotlib inline
df.pivot_table(values='Survived',index=['Pclass','Sex'],aggfunc='count')

            Survived
Pclass Sex
1      0          94
       1         122
2      0          76
       1         108
3      0         144
       1         347

In [1]:
def partPrinterBoundTable(startdate,enddate,table):
    file=r"C:\Distribs\{}_actualization.sh".format(table)
    day=startdate
    beelinecon = """beeline -u "jdbc:hive2://bda41node04:10000/;principal=hive/bda41node04.moscow.alfaintra.net@moscow.alfaintra.net" -e"""
    with open(file,'w') as f:
        f.write("#!/usr/bin/env bash \n")
        while day <= enddate:
            day1=datetime.date.strftime(day,"%Y%m%d")
            #f.write(beelinecon  +"\"" + f"alter table l_hdb_bki.{table} drop partition (day={day1}) ;" +"\"" +"\n")
            f.write(f"hdfs dfs -rm -R -skipTrash /live_system/l_hdb/BKI/{table}/day={day1}\n")
            #f.write(f"hadoop distcp hdfs://bda31/pilot/p_bkireports/db/{table}/day={day1}/ hdfs://bda41/live_system/l_hdb/BKI/{table}/ \n")
            #f.write(beelinecon +"\"" +  f"alter table l_hdb_bki.{table} add partition (day={day1}) location '/live_system/l_hdb/BKI/{table}/day={day1}';" +"\"" +"\n")
            day=day+datetime.timedelta(days=1)
        f.write(f"hadoop distcp hdfs://bda31/pilot/p_bkireports/db/{table}/day=2020" + "{01,02}*"  + f"/ hdfs://bda41/live_system/l_hdb/BKI/{table}/ \n")

In [2]:
import datetime
partPrinterBoundTable(startdate=datetime.date(2020,1,1),enddate=datetime.date(2020,2,29),table='parsing_sm3_result')

In [9]:
import datetime
for t in ["parsing_cr_addr", "parsing_cr_cf", "parsing_cr_fin", "parsing_cr_models", "parsing_cr_name", "parsing_cr_phone", "parsing_cr_requests"]:                
    partPrinterBoundTable(startdate=datetime.date(2019,1,10),enddate=datetime.date(2019,11,30),table=t)

In [16]:
def dropAddPart(startdate,enddate,table):
    file=r"C:\Distribs\{}_dropaddparts.sh".format(table)
    day=startdate
    with open(file,'w') as f:
        #f.write("#!/usr/bin/env bash \n")
        while day <= enddate:
            day1=datetime.date.strftime(day,"%Y%m%d")
            f.write(f"alter table l_hdb_bki.{table} drop partition (day={day1}) ;"  +"\n")
            #f.write(f"hdfs dfs -rm -R -skipTrash /live_system/l_hdb/BKI/{table}/day={day1}\n")
            #f.write(f"hdfs dfs -cp hdfs://bda31node01:8020/pilot/p_bkireports/db/{table}/day={day1}/ /live_system/l_hdb/BKI/{table}/ \n")
            f.write(f"alter table l_hdb_bki.{table} add partition (day={day1}) location '/live_system/l_hdb/BKI/{table}/day={day1}';"  +"\n")
            day=day+datetime.timedelta(days=1)

In [15]:
dropAddPart(startdate=datetime.date(2019,1,10),enddate=datetime.date(2019,11,30),table="parsing_cr_addr")

In [17]:
for t in [ "parsing_cr_cf", "parsing_cr_fin", "parsing_cr_models", "parsing_cr_name", "parsing_cr_phone", "parsing_cr_requests"]:                
    dropAddPart(startdate=datetime.date(2019,1,10),enddate=datetime.date(2019,11,30),table=t)

In [2]:
25 * 110 /60 /24

1.9097222222222223